Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh99-v2.tmx
Source language: bo
Languages: en

source: གང་མེད་པའི་ཆོས་ལ་དེ་བདག་མེད་པ་དང་། མི་རྟག་པ་དང་མི་བདེ་བ་དང་མི་གཙང་བར་དེ་བཟོད་པ་འདི་དག་ཐོབ་ནས་བསྐལ་པ་གྲངས་མེད་པར་ནམས་ཀྱང་བདག་ཏུ་མངོན་པར་མ་ཞེན་ཏོ། །
en: However, when instead one accepts the absence of self where there is no self, and when likewise impermanence, unhappiness, and impurity are accepted, one will not become attached to the conception of a self, even after incalculable eons.’

source: དེས་སེམས་ཅན་གྲངས་མེད་པ་དག་བདག་ཏུ་མངོན་པར་ཞེན་པ་ལས་བསྐྱོད་ནས་སྟོང་པ་ཉིད་ལ་རབ་ཏུ་བཙུད་དོ། །
en: Thus the sage proceeded to shake innumerable sentient beings out of their attachment to a self and established them in emptiness.

source: མཽད་གལ་གྱི་བུ་དེ་ཇི་སྙམ་དུ་སེམས། དེའི་ཚེ་དེའི་དུས་ན་དྲང་སྲོང་ཤིན་ཏུ་ཁྲིད་བྱེད་ཅེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན་དེ་ལྟར་མི་བལྟ་སྟེ
en: “Maudgalyāyana, in case you may think that at that time the sage Thorough Guide was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་དྲང་སྲོང་ཤིན་ཏུ་ཁྲིད་བྱེད་ཅེས་བྱ་བར་གྱུར་ཏོ། །
en: In those days I was the sage Thorough Guide.

source: ངས་སེམས་ཅན་དེ་དག་བདག་ཏུ་འདུ་ཤེས་པ་ལས་བསྐྱོད་ནས་སྟོང་པ་ཉིད་ལ་རབ་ཏུ་བཙུད་དོ། །
en: I shook those beings out of their conception of a self and established them in emptiness.

source: མཽད་གལ་གྱི་བུ་ཇི་ཙམ་དུ་དེ་བཞིན་གཤེགས་པས་འདི་ལྟ་སྟེ། ཆོས་ཐམས་ཅད་མཉམ་པ་ཉིད་དུ་དེ་དག་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ན།
en: “Maudgalyāyana, consider how the thus-gone ones have awakened to the realization of the sameness of all phenomena while

source: སོ་སོའི་སྐྱེ་བོ་ཐོས་པ་དང་མི་ལྡན་པ་དག་བདག་ཏུ་རྟོག་པར་བྱེད། རྟག་པ་དང་གཙང་བར་རྟོག་པར་བྱེད་དེ། བདག་ཉིད་སྡུག་བསྔལ་གྱི་ཚོགས་དང་། སྦྲེལ་བ་ལ་ལྟོས།
en: ordinary, ignorant individuals conceive in terms of a self, permanence, and purity, which results in their various sufferings.

source: འདི་ལྟ་སྟེ་དཔེར་ན། དར་གྱི་སྲིན་བུ་ནི་བདག་ཉིད་ཀྱིས་བདག་དཀྲིས་ཏེ་མེས་སྲེག་ཅིང་འབར་བ་ན་རང་གི་སྲིན་བལ་ཡང་དག་པར་བྱུང་བ་དེ་ཉིད་ཀྱིས་སྲེག་གོ། །
en: It is like this example: when a silkworm lying in its cocoon is burned by fire it will be burned by its very own silk threads.

source: དེ་བཞིན་དུ་བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་རང་ལས་ཡང་དག་པར་བྱུང་བའི་སྡུག་བསྔལ་གྱི་ཚོགས་དེས་སྲེག་གོ། །
en: Likewise, ordinary, childish beings are similarly burned by the various types of suffering that they have created.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔས་ལས་མངོན་པར་འདུ་བྱེད་པ་ནི་འཆིང་བར་བལྟའོ། །
en: Maudgalyāyana, bodhisattvas therefore consider the formations of karmic action to be bondage.

source: མེ་དེ་ལ་མངོན་པར་ཞེན་ཅིང་ཀུན་ཏུ་འདོད་ཆགས་པ་དེས་སེམས་ཅན་དག་སྲེག་སྟེ།
en: Sentient beings are burned in the fire of their attachment and desire.

source: དེ་དག་སྲེག་པ་ན་སེམས་ཅན་དག་མ་རིག་པའི་སྒྲིབ་པས་སྲེག་པ་ལ་ཡང་དག་པར་སྦྱར་བའི་སྔོན་གྱི་མཐའ་མི་ཤེས་སོ། །
en: However, when thus burned, their ignorant obscurations prevent them from recognizing the initial context that drew them into the fire.

source: མངོན་པར་ཞེན་པ་དང་། ཀུན་ཏུ་ཆགས་པ་ལ་མཁས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་ཕྱིར་མི་ལྡོག་ཅིང་མྱུར་དུ་ཆོས་ཉིད་ཐོབ་པར་འགྱུར་རོ། །
en: A bodhisattva who is skilled with respect to attachment and desire will become irreversible and quickly attain the intrinsic nature.

source: མཽད་གལ་གྱི་བུ་ངས་གནས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པར་བྱ་བའི་དོན་དུ་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་གནས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་སེམས་ཅན་རྣམས་ལ་ཇི་ལྟར་ཡང་དག་པར་རབ་ཏུ་བསྟན་པར་བྱ་སྙམ་ནསདགེ་བའི་རྩ་བ་རྒྱ་ཆེ་བ་སྣ་ཚོགས་དཔག་ཏུ་མེད་པ་དག་མངོན་པར་འདུས་བྱས་སོ། །
en: “Maudgalyāyana, when I was training in the practices of a bodhisattva in the past, I created vast and boundless roots of virtue in order to understand the origin as related to knowledge of what is possible. I did this by wondering how I could fully awaken to unsurpassed and perfect buddhahood and then teach sentient beings about the knowledge of the origin as related to knowledge of what is possible.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་འཁོར་བ་དཔག་ཏུ་མེད་པ་ནས། དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན་དྲང་སྲོང་གནས་འགོག་པ་ལ་མཁས་པ་ཞེས་བྱ་བ་
en: “Long ago in the limitless cycle of existence, Maudgalyāyana, long before even the distant past there was a sage known as Expert about Cessation of What Is Possible.

source: སྲིད་པ་དང་འགྲོ་བའི་འཆིང་བ་དང་། སྐྱེ་བ་ཐམས་ཅད་ལ་མི་གནས་པ་ཞིག་བྱུང་ངོ་། །
en: He was beyond existence, the ties of existence, and any type of bith.

source: ཀྱེ་མ་སེམས་ཅན་འདི་དག་ཐམས་ཅད་ནི་ཆོས་རྣམས་ཀྱི་རང་བཞིན་མ་ཤེས་པས་ཉོན་མོངས་སོ།
en: ‘Alas, all these beings are afflicted by their own ignorance of the nature of things.

source: དེ་དག་རང་བཞིན་མེད་པའི་ཆོས་རྣམས་ལ་མངོན་པར་ཞེན་ནས། བདག་ཉིད་སྡུག་བསྔལ་གྱི་རྒྱུ་ཡོངས་སུ་འཛིན་ཏོ། །
en: Thus, attached to things that have no nature, they embrace the very causes of their own suffering.

source: བདག་ཉིད་སྡུག་བསྔལ་གྱི་རྒྱུ་ཡོངས་སུ་བཟུང་བས་བདག་ཉིད་སྡུག་བསྔལ་མྱོང་ངོ་། །
en: Seizing the causes of their own suffering, they suffer.’

source: སྙམ་ནས་དེ་རང་བཞིན་མེད་པའི་ཆོས་ཐམས་ཅད་རིག་ཅིང་མངོན་པར་འདུ་བྱེད་པའི་རྒྱུ་ཡོངས་སུ་ཤེས་སོ། །
en: “In this way he understood all things that have no nature and comprehended the causes of karmic formation.

source: མངོན་པར་འདུ་བྱེད་པའི་རྒྱུ་ཡོངས་སུ་ཤེས་ནས། ཤེས་པའི་རྒྱུ་སྤེལ་ཅིང་མི་ཤེས་པའི་རྒྱུ་ཡང་དག་པར་བཅད་དོ། །
en: Having comprehended the causes of karmic formation, he increased the causes of knowledge and cut through the causes of ignorance.

source: མི་དགེ་བའི་ཆོས་ཐམས་ཅད་ནས་ཐམས་ཅད་དུ་ཡང་དག་པར་གཅད་པའི་ཕྱིར་ཞུགས་ཤིང་། དགེ་བའི་ཆོས་རྣམ་པར་འཕེལ་བར་བྱ་བ་ལ་ཡང་ཞུགས་སོ། །
en: Thus he practiced to eliminate unvirtuous qualities at all times and occasions, and instead let the qualities of virtue flourish.

source: དེས་སེམས་ཅན་ཁྲི་ཕྲག་དཔག་ཏུ་མེད་པ་དག་གནས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ལ་ཡོངས་སུ་སྨིན་པར་བྱས་སོ། །
en: In this way he matured innumerably many tens of thousands of beings within the knowledge of the origin as related to knowledge of what is possible.

source: མཽད་གལ་གྱི་བུ་དེ་ཇི་སྙམ་དུ་སེམས། དེའི་ཚེ་དེའི་དུས་ན་དྲང་སྲོང་གནས་ཤེས་པ་འགོག་པ་མཁས་པ་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན་དེ་ལྟར་མི་བལྟ་སྟེ་ང་དེར་གྱུར་ཏོ། །
en: “Maudgalyāyana, in case you may think that at that time Expert about Cessation of What Is Possible was anyone else, do not, because I was him.

source: ངས་སེམས་ཅན་དཔག་ཏུ་མེད་པ་དེ་དག་གནས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ལ་ཡོངས་སུ་སྨིན་པར་བྱས་སོ། །
en: In this way I matured beings beyond count within the knowledge of the origin as related to knowledge of what is possible.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔས་གནས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ཡོངས་སུ་སྨིན་པར་བྱ་བ་ལ་མཁས་པར་བྱའོ། །
en: Therefore, Maudgalyāyana, bodhisattvas must become expert about the maturation of knowledge of the origin as related to knowledge of what is possible.

source: གནས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ལ་མཁས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་མྱུར་དུ་ཕྱིར་མི་ལྡོག་པའི་ཆོས་རྣམས་ལ་རབ་ཏུ་གནས་པར་འགྱུར་རོ། །
en: A bodhisattva who is an expert on the knowledge of the origin as related to knowledge of what is possible will soon abide within the qualities of the irreversible stage.

source: མཽད་གལ་གྱི་བུ་ངས་གནས་ཤེས་པ་འགོག་པ་ཤེས་པར་བྱ་བའི་དོན་དུ། སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་དེ་བཞིན་དུ་སྦྱར་ཏེདགེ་བའི་རྩ་བ་དཔག་ཏུ་མེད་པ་དག་མངོན་པར་འདུས་བྱས་སོ། །
en: “Maudgalyāyana, when I was training in the practices of a bodhisattva in the past, I created boundless roots of virtue in order to understand cessation as related to knowledge of what is possible. I did this by wondering how I could fully awaken to unsurpassed and perfect buddhahood and then teach sentient beings about the knowledge of cessation as related to knowledge of what is possible.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན། འཁོར་བ་དཔག་ཏུ་མེད་པ་ནས། དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན་རྒྱལ་པོ་ས་འཛིན་ཅེས་བྱ་བ་
en: “Long ago in the limitless cycle of existence, Maudgalyāyana, long before even the distant past there was a king called Bhūbhṛta.

source: ཆོས་ཀྱི་རྒྱལ་པོ་ཆོས་དང་ལྡན་པ་སེམས་ཅན་རྣམས་ལ་སྙིང་བརྩེ་བ་ཞིག་བྱུང་ངོ་། །
en: He was a religious and just king, who had a loving heart for sentient beings.

source: དེ་ཅིའི་ཕྱིར་སེམས་ཅན་འདི་དག་སྡུག་བསྔལ་མི་ཟད་པ་མྱོང་།
en: ‘Why do these beings experience endless suffering.

source: དེ་ཅིའི་ཕྱིར་འདི་དག་གྲོལ་བ་རྣམས་ཀྱི་ཐར་བར་འགྱུར་སྙམ་ནས།
en: How might they gain liberation and freedom from their pains?’

source: དེ་སེམས་ཅན་དེ་དག་གི་སྔོན་གྱི་ལས་མངོན་པར་འདུ་བྱེད་པ་ཡོངས་སུ་རྟོག་གོ །
en: With that thought in mind the king then examined those beings’ previous acts of karmic formation.

source: དེ་སེམས་ཅན་ཁ་ཅིག་ཀུན་ཏུ་འབར་བ་དག་གིས་བདག་གི་ངོ་བོ་རབ་ཏུ་འབར་ཞིང་ཤིན་ཏུ་འབར་བར་གྱུར་ནས་རྒྱུག་རབ་ཏུ་རྒྱུག་ཅིང་ཉམ་ཐག་པའི་སྐད་འབྱིན་པ་མཐོང་ངོ་། །
en: Thus he saw some sentient beings ablaze, being totally consumed by fire while running and crying.

source: སེམས་ཅན་ཁ་ཅིག་བྱའི་ཚོགས་ཀྱིས་གཙེས་ཏེ། ཉམ་ཐག་པའི་སྐད་འབྱིན་ཅིང་རྒྱུག་རབ་ཏུ་རྒྱུག་པ་མཐོང་ངོ་། །
en: Others he saw were attacked by birds while crying and running away.

source: སེམས་ཅན་ཁ་ཅིག་སྲིན་བུ་དག་གིས་ཟོས་ནས། ཉམ་ཐག་པའི་སྐད་འབྱིན་ཅིང་རྒྱུག་རབ་ཏུ་རྒྱུག་པ་མཐོང་ངོ་། །
en: Others again were eaten by worms as they cried and ran fast.

source: སེམས་ཅན་ཁ་ཅིག་དྲི་ང་བས་ཁྱབ་ནས། ཉམ་ཐག་པའི་སྐད་འབྱིན་ཅིང་རྒྱུག་རབ་ཏུ་རྒྱུག་པར་མཐོང་ནས།
en: Still others were engulfed by a foul smell, crying pitifully and running fast.

source: དེ་འདི་སྙམ་དུ་སེམས་ཏེ། གནས་ལ་མངོན་པར་ཞེན་པའི་རྒྱུ་དང་། ལས་མངོན་པར་འདུ་བྱེད་པའི་རྒྱུས་སེམས་ཅན་འདི་དག་སྡུག་བསྔལ་སྣ་ཚོགས་མྱོང་ངོ་སྙམ་མོ། །
en: “The king thought, ‘These beings suffer in different ways because of being attached to their lives and due to their subsequent engagement in karmic formation.’

source: དེ་སེམས་ཅན་གང་མི་རིགས་པ་ལ་ཡང་དག་པར་རབ་ཏུ་གནས་པར་མིག་གིས་མཐོང་བའི་སེམས་ཅན་དེ་དག་ལ་གནས་ཀྱི་སྐྱོན་དེ་དག་ཡང་དག་པར་སྟོན་ཏེ།
en: Hence, having seen with his own eyes how those beings remained in error, he proceeded to teach them about the flaws of such ways.

source: ཁྱེད་ཅག་བདག་གི་གནས་དག་ལ་དགའ་བར་ཡང་དག་པར་རབ་ཏུ་བལྟས་པས་བདག་ལ་དགའ་བའི་རྒྱུས་སྡིག་པའི་ལས་འདི་དག་མངོན་པར་འདུས་བྱས་སོ། །
en: He said, ‘Because you regard your own lives with such fondness, that fondness causes you to engage in negative karmic acts.

source: གང་མངོན་པར་འདུས་བྱས་པའི་རྒྱུས་ལུས་ཀུན་ཏུ་འབར་ལ་རྒྱུག་རབ་ཏུ་རྒྱུག་གོ། །
en: It is due to such karmic formation that you race around with your bodies ablaze,

source: བྱའི་ཚོགས་དག་གིས་གཙེས་ཤིང་རྒྱུག་རབ་ཏུ་རྒྱུག །
en: while being attacked by birds,

source: སྲིན་བུའི་ཚོགས་དག་གིས་ཟོས་ཤིང་རྒྱུག་རབ་ཏུ་རྒྱུག་གོ། །
en: while being eaten by worms,

source: དྲི་ང་བས་ཁྱབ་ཅིང་རྒྱུག་རབ་ཏུ་རྒྱུག་སྟེ།
en: or while engulfed by a foul smell.

source: དེ་དག་བདག་གི་ངོ་བོ་སོ་སོར་འདོད་པས་སྡུག་བསྔལ་ཉིད་ཡང་དག་པར་བསྐྱེད་པ་ལ་མ་གཏོགས་པར་བདེ་བ་ཅུང་ཟད་ཀྱང་རྗེས་སུ་མ་ཐོབ་བོ། །
en: Since you believe in a self that truly exists, you experience nothing but suffering and never find even a bit of happiness.

source: སོ་སོར་འཛིན་པའི་རྒྱུས་སྡིག་པའི་ལས་འདི་དག་མངོན་པར་འདུས་བྱས་སོ། །
en: Because of your beliefs in individuality, you engage in negative acts,

source: གང་རྣམ་པར་སྨིན་པ་འདི་མྱོང་ངོ་། །
en: and so you experience this sort of ripening.

source: ཁྱེད་ཅག་ལུས་ལ་མི་ཟད་པའི་འདུ་ཤེས་ཉེ་བར་ཞོག་ཤིག །མངོན་པར་ཞེན་པ་མེད་པའི་འདུ་ཤེས་ཀྱང་ཉེ་བར་ཞོག་ཤིག །མི་གཙང་བའི་འདུ་ཤེས་ཀྱང་ཉེ་བར་ཞོག་ཤིག་དང་ལེགས་སོ། །
en: Consider instead the body to be inexhaustible, regard it without attachment, and perceive it as unclean.’

source: དེ་ཆོས་བསྟན་པ་དེས་སེམས་ཅན་ཁྲི་ཕྲག་དཔག་ཏུ་མེད་པ་དག་ཕྱིར་མི་ལྡོག་པ་ཉིད་རྗེས་སུ་ཐོབ་བོ། །
en: “Based on that teaching of the Dharma innumerably many tens of thousands of beings attained the irreversible stage.

source: མཽད་གལ་གྱི་བུ་དེ་ཇི་སྙམ་དུ་སེམས། དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་ས་འཛིན་ཅེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན་ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ
en: Maudgalyāyana, in case you may think that at that time King Bhūbhṛta was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་ས་འཛིན་ཅེས་བྱ་བར་གྱུར་ཏོ། །
en: In those days I was King Bhūbhṛta.

source: ངས་སེམས་ཅན་ཁྲི་ཕྲག་དཔག་ཏུ་མེད་པ་དེ་དག་ཡོངས་སུ་འཛིན་པ་དེ་ལས་བཟློག་ནས་ཕྱིར་མི་ལྡོག་པ་ཉིད་ལ་རབ་ཏུ་བཙུད་དོ། །
en: In this way I caused innumerably many tens of thousands of beings to stop their grasping and arrive at irreversibility.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔས་ཡོངས་སུ་འཛིན་པ་མེད་པ་ལ་བསླབ་པར་བྱའོ། །
en: Therefore, Maudgalyāyana, bodhisattvas must train in non-grasping.

source: ཡོངས་སུ་འཛིན་པ་མེད་པ་ལ་སློབ་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་མྱུར་དུ་ཕྱིར་མི་ལྡོག་པའི་ས་འཐོབ་པར་འགྱུར་རོ། །
en: A bodhisattva who trains in non-grasping will quickly attain the level of irreversibility.

source: མཽད་གལ་གྱི་བུ་ངས་གནས་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པར་བྱ་བའི་དོན་དུ་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ནས་མངོན་པར་འདུས་བྱས་པའི་བར་དང་། ཡང་དག་པར་རབ་ཏུ་བསྟན་པའི་བར་དུའོ། །
en: “Maudgalyāyana, when I was training in the practices of a bodhisattva in the past, I created boundless roots of virtue in order to understand the path that leads to cessation as related to knowledge of what is possible. I did this by wondering how I could fully awaken to unsurpassed and perfect buddhahood and then teach sentient beings about the knowledge of the path that leads to cessation as related to knowledge of what is possible.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་ནས་དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན་རྒྱལ་པོ་དྲང་སྲོང་སྲིད་པ་ཤེས་པ་རྟོགས་པ་ཞེས་བྱ་བ་ཞིག་བྱུང་སྟེ
en: “Long ago in the limitless cycle of existence, Maudgalyāyana, long before even the distant past there was a king and sage by the name of Knower of Existence.

source: བྱས་པ་དང་ལྡན་པ། ཀུན་ཤེས་པ་དང་། ཚོར་བ་ཤེས་པ་དང་། ཚོར་བ་པོ་ཤེས་པ་དང་། འདུ་བྱེད་ཤེས་པ་དང་། བྱེ་བྲག་ཤེས་པ་དང་། དགེ་བ་ཤེས་པ་དང་། ཁ་ན་མ་ཐོ་བ་དང་བཅས་པ་ཤེས་པ་དང་། ཁ་ན་མ་ཐོ་བ་མེད་པ་ཤེས་པ་དང་། བྱས་པ་ཤེས་པ་དང་། དེ་ལས་གཞན་པ་འཇིག་རྟེན་པའི་བཟོའི་གནས་དང་། ལས་ཀྱི་གནས་རྣམས་ལ་བསླབས་པར་གྱུར་ཏོ། །
en: An accomplished and learned man, he was trained in understanding feelings and the one that feels, as well as formations, particulars, virtues, evils, absence of evil, performed acts, and also the mundane sciences and crafts.

source: བཟོ་གང་ལ་བསླབས་པས་སྐྱེ་བ་མེད། འཇིག་པ་མེད། འཆི་བ་མེད། མི་དགའ་བ་མེད་པ་ཡང་དག་པར་རབ་ཏུ་སྦྱང་ཞིང་། མི་དགའ་བ་དང་བྲལ་བའི་བཟོ་ཅུང་ཟད་ཡོད་དོ་སྙམ་མོ། །
en: ‘What type of science might one learn to become free from birth, destruction, death, and unhappiness? Might there be some form of science that is devoid of unhappiness?’

source: དེ་དེ་ལྟར་སོ་སོར་རྟོག་པ་ན་བཟོ་ཅུང་ཟད་ཀྱང་མ་དམིགས་ཏེ། གང་ལ་སློབ་པ་ན་སྐྱེ་བ་མེད། འཇིག་པ་མེད། འཆི་བ་མེད། སྐྱེས་པ་མེད་དོ། །
en: Yet when inquiring in this way he failed to find any such science that is beyond arising, destruction, death, and birth.

source: དེ་འདི་སྙམ་དུ་སེམས་ཏེ། བྱ་བ་འདི་དག་ཐམས་ཅད་ནི་རྫ་མཁན་གྱི་སྣོད་དང་འདྲ་སྟེ། སེམས་ཅན་ཡང་མེད། འཆི་བ་ཡང་ཤེས་སོ། །
en: ‘These actions are like a potter’s jars,’ he thought. ‘They contain no sentient being, and they will end.

source: གལ་ཏེ་སེམས་ཅན་དག་མངོན་པར་འདུ་མི་བྱེད་ན་འཆི་བ་མེད་ཅིང་སྐྱེས་པ་མེད་དོ་སྙམ་ནས།
en: If beings do not engage in karmic formation there will neither be death nor birth.’

source: དེ་དེའི་ཚེ་དེ་ལྟ་བུའི་སེམས་ཀྱི་ཏིང་ངེ་འཛིན་ཐོབ་སྟེ།
en: “At that point the king attained mental absorption,

source: ཇི་ལྟར་སེམས་མཉམ་པར་བཞག་པས་སེམས་ཅན་རྣམས་ཀྱི་ལུས་ཐ་དད་པ་རྗེས་སུ་དྲན་ནོ། །
en: and as his mind thus rested in equipoise, he thought of the distinct bodies of sentient beings.

source: དེ་སངས་རྒྱས་ཀྱི་ཞིང་གི་རྡུལ་ཕྲ་མོ་སྙེད་ཀྱི་སེམས་ཅན་རེ་རེའི་བདག་གི་ངོ་བོ་ཐ་དད་པ་རྗེས་སུ་དྲན་ནོ། །
en: Considering the individual identities of as many beings as there are particles in a buddha realm,

source: རྒྱུ་གང་དང་རྐྱེན་གང་དག་གིས་བདག་གི་ངོ་བོ་གྲུབ་པ་དེ་དག་ཐམས་ཅད་རྗེས་སུ་དྲན་ཞིང་། དམིགས་པ་གང་གིས་བདག་གི་ངོ་བོ་ཐ་དད་པ་དེ་དག་ཐམས་ཅད་རྗེས་སུ་དྲན་ནོ། །
en: he determined the causes and conditions that create those identities, as well as the ways of apprehension whereby such identities emerge.

source: གང་གིས་བདག་གི་ངོ་བོ་མངོན་པར་འགྲུབ་པར་མི་འགྱུར་བའི་ཤེས་པ་དེ་གང་ལས་འཐོབ་སྙམ་མོ། །
en: ‘How can one acquire a cognition that does not create a personal identity?

source: མངོན་པར་འདུ་མི་བྱེད་པ་ལས་གཞན་མ་ཡིན་ཏེ།
en: Only by disengaging from karmic formation.

source: གང་ཞིག་མངོན་པར་འདུ་མི་བྱེད་ན་དེ་ཐ་དད་པར་འགྱུར་བ་མེད་ན་ཡང་།
en: Whenever there is no such formation, there will not be any such distinctions.

source: རྒྱུ་མངོན་པར་འདུ་བྱེད་པ་ལྟ་ག་ལ་ཡོད་སྙམ་མོ། །
en: But when there is such causal formation, there obviously will be.

source: མ་རིག་པ་དང་སྲེད་པ་ལས་གཞན་མ་ཡིན་ཏེ། སྲེད་པའི་རྒྱུས་ལས་མངོན་པར་འདུ་བྱེད་དེ།
en: All of that is due to ignorance and craving, and craving causes karmic activity.

source: སྐྱོན་དེ་དག་རབ་ཏུ་མི་ཤེས་སོ། །
en: Yet beings are not aware of this.

source: སྲེད་པ་འགགས་ན་ལས་མངོན་པར་འདུ་མི་བྱེད་དེ།
en: If craving ceases there will not be any karmic activity.

source: ཤེས་པ་དེ་ཡང་རབ་ཏུ་མི་ཤེས་སོ། །
en: Yet beings do not understand this either.

source: དེ་ལྟ་བས་ན་མཁས་པས་ཡེ་ཤེས་ཀྱི་སྣང་བ་བྱའོ། །
en: Thus the wise must let the light of wisdom unfold.

source: ཡེ་ཤེས་ཀྱི་སྣང་བའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་ཕྱིར་མི་ལྡོག་པ་ཉིད་ལ་རབ་ཏུ་གནས་པར་འགྱུར་རོ་སྙམ་མོ། །
en: The bodhisattva who spreads the light of wisdom will reach the irreversible stage.’

source: མཽད་གལ་གྱི་བུ་དེ་ཇི་སྙམ་དུ་སེམས། དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་དྲང་སྲོང་ཤེས་པ་རྟོགས་པ་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན་ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ
en: “Maudgalyāyana, in case you may think that at that time King Knower of Existence was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་དྲང་སྲོང་ཤེས་པ་རྟོགས་པ་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: In those days I was King Knower of Existence.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔས་ཤེས་པ་རྟོགས་པར་བྱའོ། །
en: Therefore, Maudgalyāyana, bodhisattvas must gain knowledge.

source: དངོས་པོ་ཤེས་པ་རྟོགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་ཕྱིར་མི་ལྡོག་པ་ཉིད་ལ་རབ་ཏུ་གནས་པར་འགྱུར་རོ། །
en: The bodhisattva who achieves knowledge of entities reaches the irreversible stage.”

source: མཽད་གལ་གྱི་བུ་ངས་ཕྱི་མའི་མཐའ་ཤེས་པར་བྱ་བའི་དོན་དུ་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་ཕྱི་མའི་མཐའ་ཤེས་པ་སེམས་ཅན་རྣམས་ལ་ཇི་ལྟར་ཡང་དག་པར་རབ་ཏུ་བསྟན་པར་བྱ་སྙམ་ནས་དགེ་བའི་རྩ་བ་དཔག་ཏུ་མེད་པ་དག་མངོན་པར་འདུས་བྱས་སོ། །
en: “Maudgalyāyana, when I was training in the practices of a bodhisattva in the past, I created boundless roots of virtue in order to understand the future. I did this by wondering how I could fully awaken to unsurpassed and perfect buddhahood and then teach sentient beings about the knowledge of the future.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་འཁོར་བ་དཔག་ཏུ་མེད་པ་ནས་དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན་གཙོ་བོ་བློ་གྲོས་དྲང་པོ་ཞེས་བྱ་བ་སེམས་ཅན་རྣམས་ཀྱི་རྩོད་པ་གཅོད་པ་ལ་མཁས་པ།
en: “Long ago in the limitless cycle of existence, Maudgalyāyana, long before even the distant past there was a leader known as Honest Intelligence, who was expert in settling the arguments of sentient beings.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་རྟོག་པ་སྨྲས་པ་ཙམ་ཉིད་ཀྱིས་སྨྲས་པ་འདི་དག་ནི་རྒྱལ་ལོ། །
en: As soon as he had heard people’s ideas he would immediately know whether or not they would win in a given dispute.

source: སྨྲས་པ་འདི་དག་ནི་མི་རྒྱལ་ལོ་ཞེས་ཡང་དག་པར་རབ་ཏུ་ཤེས་པ་ཞིག་བྱུང་ངོ་། །
en: [As soon as he had heard people’s ideas] he would immediately know whether or not they would win in a given dispute.

source: དེ་ཡང་ལུས་དང་སེམས་ཀྱི་སྤྱོད་ལམ་མཆོག་ཏུ་མཛེས་ཏེ། དེ་བལྟ་བའི་ཕྱིར་མཐོང་བ་ཙམ་ཉིད་ཀྱིས་སེམས་ཅན་རྣམས་ཀྱི་མིག་འཆིང་ངོ་། །
en: The physical and mental conduct of Honest Intelligence was absolutely beautiful, and so when people came to see him they could not take their eyes off him again.

source: གཙོ་བོ་བློ་གྲོས་དྲང་པོ་དོན་བྱ་བའི་ཕྱིར་ལངས་ནས་གཅིག་པུ་དབེན་པར་སོང་སྟེ། ནང་དུ་ཡང་དག་འཇོག་ལ་ཞུགས་པ་དང་།
en: “To accomplish what is meaningful the leader Honest Intelligence decided to leave, enter solitude, and practice meditation.

source: དེ་ལྟ་བུའི་སེམས་ཀྱི་ཏིང་ངེ་འཛིན་འདི་ཐོབ་ནས། ཇི་ལྟར་སེམས་མཉམ་པར་བཞག་པས་ལྷའི་མིག་ཐོབ་བོ། །
en: Once he had achieved mental absorption, he accomplished the divine eye due to this mental equipoise.

source: དེ་ལྷའི་མིག་གིས་སེམས་ཅན་དག་འཆི་བ་དང་། སྐྱེ་བ་དང་། བདེ་འགྲོ་དང་། ངན་འགྲོར་སྐྱེས་པ་མཐོང་ནས
en: With this eye he then perceived sentient beings’ deaths and births as well as their pleasant and unfortunate states.

source: གང་འཇིག་རྟེན་འདི་ནས་འཇིག་རྟེན་ཕ་རོལ་ཏུ་འགྲོ་བའི་ཆོས་དེ་གང་ཡིན་སྙམ་པ་དང་།
en: ‘What is it that proceeds from this world to the next?’

source: གང་འཇིག་རྟེན་འདི་ནས་འཇིག་རྟེན་ཕ་རོལ་ཏུ་འགྲོ་བ་དེ་འདི་ཡིན་ཞེས་མ་དམིགས་སོ། །
en: Yet he could not find anything that transferred from one world to another,

source: ཆོས་འདི་དག་གི་རང་གི་ངོ་བོ་ནི་ཆུ་ཟླ་ལྟ་བུ་སྟེ།
en: ‘In essence these phenomena are like the moon’s reflection in water.

source: འདི་ལྟ་སྟེ་དཔེར་ན་ཆུའི་ནང་དུ་ཟླ་བ་སོང་བ་དང་། ཆུ་ཟླའི་དཀྱིལ་འཁོར་དུ་རྣམ་པར་རིག་པ་ཡང་སྣང་ངོ་། །
en: It looks as if the moon has gone into the water and the disk of the moon is also visible there.

source: དེ་བཞིན་དུ་ཆོས་འདི་དག་ཐམས་ཅད་ཀྱང་ཆུ་ཟླ་དང་འདྲ་སྟེ། ཆོས་རྣམས་ཀྱི་འཕོ་བ་ཡང་མེད་ལ། འཇིག་རྟེན་ཕ་རོལ་ཏུ་རྣམ་པར་རིག་པར་ཡང་སྣང་སྟེ།
en: All these phenomena are like that—although there is no thing that transfers, it may appear as if something has transferred to the next world.

source: གང་འཇིག་རྟེན་འདི་ནས་འཇིག་རྟེན་ཕ་རོལ་ཏུ་འཕོ་བའི་ལས་འདི་ན་ཆུང་ཟད་ཀྱང་མེད་དོ་སྙམ་མོ། །
en: However, the karmic action that is transferred from one world to another does not dissipate.’

source: དེའི་ཚེ་སྐྱེ་བོ་དག་ཆུ་ཟླ་ལྟ་བུའི་ཆོས་ཐམས་ཅད་ལ་བཙུད་ཅིང་རབ་ཏུ་བཀོད་དོ། །
en: “The leader Honest Intelligence then guided sentient beings to this understanding of phenomena being like the moon’s reflection, and he established them within that.

source: དེའི་སྐྱེ་བོ་དེ་དག་ཆུ་ཟླ་ལྟ་བུའི་ཆོས་ཐམས་ཅད་རྟོགས་ནས། ཕྱིར་མི་ལྡོག་པའི་ཆོས་ལ་རབ་ཏུ་གནས་སོ། །
en: Thus, realizing how phenomena are like the moon reflected in water, they came to abide within the qualities of irreversibility.

source: མཽད་གལ་གྱི་བུ་དེ་ཇི་སྙམ་དུ་སེམས། དེའི་ཚེ་དེའི་དུས་ན་གཙོ་བོ་བློ་གྲོས་དྲང་པོ་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན་ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ
en: “Maudgalyāyana, in case you may think that at that time the leader Honest Intelligence was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་གཙོ་བོ་བློ་གྲོས་དྲང་པོ་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: In those days I was the leader Honest Intelligence.

source: ངས་སེམས་ཅན་ཁྲི་ཕྲག་དཔག་ཏུ་མེད་པ་དག་ཕྱིར་མི་ལྡོག་པ་ཉིད་ལ་རབ་ཏུ་བཙུད་དོ། །
en: Thus I guided innumerably many tens of thousands of beings to the irreversible stage.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ཐམས་ཅད་ཀྱང་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བྱས། སེམས་ཅན་དཔག་ཏུ་མེད་པ་དག་གི་དོན་བྱས་ནས་སེམས་ཅན་དཔག་ཏུ་མེད་པ་དག་ཕྱིར་མི་ལྡོག་པ་ཉིད་ལ་རབ་ཏུ་བཙུད་དོ། །
en: Those bodhisattvas then all purified buddha realms, benefiting boundlessly many beings and establishing them at the irreversible stage.

source: ཕུང་པོ་ལྷག་མ་མེད་པའི་མྱ་ངན་ལས་འདས་པའི་དབྱིངས་སུ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་སོ། །
en: They then passed beyond suffering within the field of nirvāṇa free from any remainder of the aggregates.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔས་ཆོས་ཐམས་ཅད་ཆུ་ཟླའི་ངོ་བོ་ལྟ་བུར་མོས་པར་བྱའོ། །
en: “Therefore, Maudgalyāyana, bodhisattvas should consider all phenomena to be, in essence, like the moon reflected in water.

source: ཆོས་ཐམས་ཅད་ཆུ་ཟླའི་ངོ་བོ་ལྟ་བུར་མོས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་མྱུར་དུ་ཕྱིར་མི་ལྡོག་པའི་ས་ཐོབ་པར་འགྱུར་རོ། །
en: A bodhisattva who regards all phenomena to be in essence like the moon reflected in water will quickly reach the level of irreversibility.

source: མཽད་གལ་གྱི་བུ་ངས་ཕྱི་མའི་མཐའ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པར་བྱ་བའི་དོན་དུ་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་དགེ་བའི་རྩ་བ་དཔག་ཏུ་མེད་པ་དག་མངོན་པར་འདུས་བྱས་པ་ནས་དེ་བཞིན་སྦྱར་རོ། །
en: “Maudgalyāyana, when I was training in the practices of a bodhisattva in the past, I created boundless roots of virtue in order to understand the origin as related to knowledge of the future. I did this by wondering how I could fully awaken to unsurpassed and perfect buddhahood and then teach sentient beings about the knowledge of the origin as related to knowledge of the future.
